# Homebrew Tap Repository
tap "homebrew/bundle"

# Homebrew Package
brew "ack"
brew "jordanbaird-ice"
brew "git"
brew "htop"
brew "hugo"   # Static Site Generator (SSG)
brew "iperf3"
brew "mas"
brew "nmap"
brew "node"
brew "poetry" # Python
brew "pyenv"  # Python
brew "smartmontools"
brew "tree"
brew "vim"   
brew "wget"
brew "zsh"

# Homebrew Cask
cask "1password"
cask "1password-cli"
cask "adguard"
cask "adguard-vpn"
cask "arc"
cask "appcleaner"
# cask "bettertouchtool"
cask "burp-suite"
cask "charles"
cask "chatgpt"
cask "cloudflare-warp"
# cask "chromedriver"
cask "datagrip"
cask "db-browser-for-sqlite"
cask "discord"
cask "find-my-ports"
cask "font-sauce-code-pro-nerd-font"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "home-assistant"
cask "imazing"
cask "iterm2"
cask "keka"
cask "latest"
# cask "line-bot-designer"
cask "little-snitch"
cask "microsoft-office"
cask "microsoft-remote-desktop"
cask "monitorcontrol"
# cask "mono-mdk-for-visual-studio"
cask "mos"
cask "motrix"
cask "netnewswire"
cask "notion"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "parallels"
cask "postman"
cask "qflipper"
# cask "qt-creator"
cask "radar"
cask "raycast"
# cask "setapp"
cask "shottr"
cask "sourcetree"
cask "stats"
cask "syncthing"
cask "synology-drive"
cask "telegram"
cask "termius"
cask "the-unarchiver"
# cask "thunderbird"
# cask "ui-browser"
# cask "vlc"
cask "visual-studio-code"
# cask "vmware-fusion"
cask "wireshark"

# Mac App Store
mas "Disk Speed Test", id: 425264550
mas "LINE", id: 539883307
mas "Notability", id: 360593530
mas "Notion Web Clipper", id: 1559269364    # Safari Extension
mas "ServerCat", id: 1501532023
mas "Twitter", id: 1482454543
mas "uBlacklist for Safari", id: 1547912640 # Safari Extension
mas "Userscripts-Mac-App", id: 1463298887   # Safari Extension
